In [51]:
import pandas as pd

In [52]:
df=pd.read_csv("AB_NYC_2019.csv")

In [53]:
df.head(3)

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,19-10-2018,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,21-05-2019,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365

In [54]:
df.dropna(inplace=True)
df.drop_duplicates(inplace=True)

In [55]:
df.describe()

,id,host_id,latitude,longitude,price,minimum_nights,number_of_reviews,reviews_per_month,calculated_host_listings_count,availability_365
count,3.882100e+04,3.882100e+04,38821.000000,38821.000000,38821.000000,38821.000000,38821.000000,38821.000000,38821.000000,38821.000000
mean,1.810081e+07,6.424582e+07,40.728129,-73.951149,142.332526,5.869220,29.290255,1.373229,5.166611,114.886299
std,1.069372e+07,7.589752e+07,0.054991,0.046693,196.994756,17.389026,48.182900,1.680328,26.302954,129.529950
min,2.539000e+03,2.438000e+03,40.506410,-74.244420,0.000000,1.000000,1.000000,0.010000,1.000000,0.000000
25%,8.721444e+06,7.029525e+06,40.688640,-73.982460,69.000000,1.000000,3.000000,0.190000,1.000000,0.000000
50%,1.887286e+07,2.837092e+07,40.721710,-73.954810,101.000000,2.000000,9.000000,0.720000,1.000000,55.000000
75%,2.756746e+07,1.018905e+08,40.762990,-73.935020,170.000000,4.000000,33.000000,2.020000,2.000000,229.000000
max,3.645581e+07,2.738417e+08,40.913060,-73.712990,10000.000000,1250.000000,629.000000,58.500000,327.000000,365.000000

In [56]:
df.nunique()

id                                38821
name                              38244
host_id                           30232
host_name                          9885
neighbourhood_group                   5
neighbourhood                       218
latitude                          17436
longitude                         13639
room_type                             3
price                               581
minimum_nights                       89
number_of_reviews                   393
last_review                        1764
reviews_per_month                   937
calculated_host_listings_count       47
availability_365                    366
dtype: int64

## Categorical

In [57]:
df["neighbourhood_group"].value_counts()

neighbourhood_group
Manhattan        16621
Brooklyn         16439
Queens            4572
Bronx              875
Staten Island      314
Name: count, dtype: int64

In [58]:
df["neighbourhood_group"].value_counts(normalize=True)

neighbourhood_group
Manhattan        0.428145
Brooklyn         0.423456
Queens           0.117771
Bronx            0.022539
Staten Island    0.008088
Name: proportion, dtype: float64

In [59]:
df["room_type"].value_counts()

room_type
Entire home/apt    20321
Private room       17654
Shared room          846
Name: count, dtype: int64

In [60]:
df["room_type"].value_counts(normalize=True)

room_type
Entire home/apt    0.523454
Private room       0.454754
Shared room        0.021792
Name: proportion, dtype: float64

In [61]:
df_new=df["neighbourhood"].value_counts().reset_index().rename(columns={"index":"neighbourhood","count":"number_of_hotels"})

In [62]:
df_new

          neighbourhood  number_of_hotels
0          Williamsburg              3163
1    Bedford-Stuyvesant              3141
2                Harlem              2204
3              Bushwick              1942
4        Hell's Kitchen              1528
..                  ...               ...
213          Holliswood                 2
214      New Dorp Beach                 2
215        Richmondtown                 1
216           Rossville                 1
217         Willowbrook                 1

[218 rows x 2 columns]

In [63]:
df_new[df_new["number_of_hotels"]>100]

         neighbourhood  number_of_hotels
0         Williamsburg              3163
1   Bedford-Stuyvesant              3141
2               Harlem              2204
3             Bushwick              1942
4       Hell's Kitchen              1528
..                 ...               ...
56    Brooklyn Heights               124
57        Forest Hills               120
58           Bay Ridge               115
59        Borough Park               110
60             Tribeca               110

[61 rows x 2 columns]

In [64]:
df_new[df_new["number_of_hotels"]>3000]

        neighbourhood  number_of_hotels
0        Williamsburg              3163
1  Bedford-Stuyvesant              3141

## Numerical

In [65]:
df["price"].value_counts(bins=5)

(-10.001, 2000.0]    38786
(2000.0, 4000.0]        20
(4000.0, 6000.0]         8
(8000.0, 10000.0]        5
(6000.0, 8000.0]         2
Name: count, dtype: int64

In [66]:
bins=(0,50,100,200,500,2000,10000)

In [67]:
df["price"].value_counts(bins=bins)

(50.0, 100.0]        14212
(100.0, 200.0]       13544
(200.0, 500.0]        5267
(-0.001, 50.0]        5176
(500.0, 2000.0]        587
(2000.0, 10000.0]       35
Name: count, dtype: int64

In [68]:
df["price"].mean()

142.33252621004095

In [69]:
df["price"].std()

196.99475591833985

In [70]:
df["price"].skew()

23.673594295123014

In [71]:
#Describe height of data
df["price"].kurt()

953.4807356344944